[Timeout] BlockStatement
src/Roller.ts:9:36
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number = 0) {
-        if (faces < 2) {
-            this._faces = 6;
-        } else {
-            this._faces = faces;
-        }
-
-        this._distribution = new Map<number, number>();
-
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
-
-        this._last = 0;
-    }
+    constructor(faces: number = 0) {}
 
     // specifies which number should be rolled and returns the recorded roll. 

[Timeout] EqualityOperator
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number = 0) {
-        if (faces < 2) {
+        if (faces >= 2) {
             this._faces = 6;
         } else {

[Timeout] ConditionalExpression
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number = 0) {
-        if (faces < 2) {
+        if (true) {
             this._faces = 6;
         } else {

[Timeout] BlockStatement
src/Roller.ts:12:16
     constructor(faces: number = 0) {
         if (faces < 2) {
             this._faces = 6;
-        } else {
-            this._faces = faces;
-        }
+        } else {}
 
         this._distribution = new Map<number, number>();

[Killed] EqualityOperator
src/Roller.ts:18:25
 
         this._distribution = new Map<number, number>();
 
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i < this._faces; i++) {
             this._distribution.set(i, 0);
         }
killedBy: Roller tests on given constructor Test on default constructor by keeping all default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] BlockStatement
src/Roller.ts:18:48
 
         this._distribution = new Map<number, number>();
 
-        for (let i = 1; i <= this._faces; i++) {
-            this._distribution.set(i, 0);
-        }
+        for (let i = 1; i <= this._faces; i++) {}
 
         this._last = 0;
killedBy: Roller tests on given constructor Test on default constructor by keeping all default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Timeout] BlockStatement
src/Roller.ts:35:33
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number {
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-
-        this._last = value;
-
-
-        this._distribution.set(value, this._distribution.get(value)! + 1);
-
-        return value;
-    }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made

[Killed] EqualityOperator
src/Roller.ts:36:26
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number {
-        if (value < 1 || value > this._faces) {
+        if (value < 1 || value >= this._faces) {
             return 0;
         }
killedBy: Roller tests on given constructor Test on  roll by faces 7 check the valid cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0

[Killed] ArithmeticOperator
src/Roller.ts:43:39
         this._last = value;
 
 
-        this._distribution.set(value, this._distribution.get(value)! + 1);
+        this._distribution.set(value, this._distribution.get(value)! - 1);
 
         return value;
killedBy: Roller tests on given constructor Test on  roll by faces 7 check the valid cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] BlockStatement
src/Roller.ts:50:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        return this._last;
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each
killedBy: Roller tests on given constructor Test on default constructor by keeping all default values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/Roller.ts:59:41
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number> {
-        return this._distribution;
-    }
+    distribution(): Map<number, number> {}
 } // end of Roller class
killedBy: Roller tests on given constructor Test on default constructor by keeping all default values
statusReason: TypeError: Cannot read properties of undefined (reading 'size')
